# IsUnderlined Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..IsUnderlined Property
TextNode Class See Also
---
Indicates whether the default formatting is set to underlined text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsUnderlined { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsUnderlined As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsUnderlined {
	bool get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace